In [1]:
import pandas as pd

In [2]:
def delete_data_from_excel(file_name):
    df = pd.read_excel(file_name)

    dfs = df[df["name"]!= 'sanjay']

    dfs.to_excel(file_name,index=False)

    return dfs

In [3]:
delete_data_from_excel("data.xlsx")

       name  age        city
0     steve   25     chennai
2     jerin   21  coimbatore
3  saravana   28       salem